In [23]:
import pandas as pd
df = pd.read_excel("sample_data.xlsx")
df.head()

      Name Gender   Age Profession    Hobby   Hometown  Matriculation Marks
0  Praveen   Male  34.0     Doctor  Singing    Lucknow                 76.0
1    Rahul   Male  31.0   Engineer  Cricket  Bangalore                 81.0
2    Rohit   Male  36.0   Engineer  Singing     Mumbai                 87.0
3    Virat   Male  42.0    Teacher  Dancing      Delhi                 88.0
4  Shreyas   Male  29.0     Singer  Cooking  Bangalore                 72.0

In [25]:
df['Matriculation Marks'].mean()

82.46666666666667

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18 entries, 0 to 17
Data columns (total 7 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Name                 18 non-null     object
 1   Gender               18 non-null     object
 2   Age                  17 non-null     float64
 3   Profession           18 non-null     object
 4   Hobby                18 non-null     object
 5   Hometown             18 non-null     object
 6   Matriculation Marks  15 non-null     float64
dtypes: float64(2), object(5)
memory usage: 1.1+ KB

Data Selection

In [4]:
data = {
    'Name' : ['Dogo','Cato','Enemy cato','Bully dogo'],
    'Age' : [2,12,14,23],
    'City' : ['Keechad', 'Fud Benke', 'Enemy malik', 'Also keechad']
}

In [5]:
df1 = pd.DataFrame(data)

* selecting a single column

In [6]:
single_column = df1['Name']
print(single_column)

0          Dogo
1          Cato
2    Enemy cato
3    Bully dogo
Name: Name, dtype: object

* selecting multiple columns

In [7]:
multiple_columns = df1[['Name','City']]
print(multiple_columns)

         Name          City
0        Dogo       Keechad
1        Cato     Fud Benke
2  Enemy cato   Enemy malik
3  Bully dogo  Also keechad

Filtering Data

In [9]:
filtered_rows = df1[df1['Age'] > 15]
print(filtered_rows)

         Name  Age          City
3  Bully dogo   23  Also keechad

In [12]:
filtered_rows_multicon = df1[(df1['Age'] < 15) & (df1['City']=="Keechad")]
print(filtered_rows_multicon)

   Name  Age     City
0  Dogo    2  Keechad

In [ ]:
filter_rowcol_toget = df.iloc[]

handling missing data

In [13]:
# remove rows with missing data
df_cleaned = df.dropna()
print(df_cleaned)

       Name  Gender   Age Profession      Hobby   Hometown  \
0   Praveen    Male  34.0     Doctor    Singing    Lucknow
1     Rahul    Male  31.0   Engineer    Cricket  Bangalore
2     Rohit    Male  36.0   Engineer    Singing     Mumbai
3     Virat    Male  42.0    Teacher    Dancing      Delhi
4   Shreyas    Male  29.0     Singer    Cooking  Bangalore
5    Ishaan    Male  44.0     Doctor    Dancing    Kolkata
6     Umesh    Male  27.0   Engineer    Singing    Chennai
9    Babita  Female  31.0   Engineer    Cooking  Ahmedabad
11    Kirti  Female  34.0    Teacher  Sketching   Guwahati
12     Puja  Female  26.0     Singer    Cooking    Kolkata
13  Sangita  Female  23.0   Engineer    Cricket    Kolkata
14    Priya  Female  25.0      Actor    Dancing       Pune
15    Angad    Male  28.0   Engineer    Singing      Delhi
17    Divya  Female  24.0     Doctor   Exercise     Jaipur

    Matriculation Marks
0                  76.0
1                  81.0
2                  87.0
3                  88.0
4                  72.0
5                  92.0
6                  79.0
9                  86.0
11                 94.0
12                 77.0
13                 89.0
14                 68.0
15                 67.0
17                 91.0

In [14]:
# remove columns with missing data
df_cleaned = df.dropna(axis=1)
print(df_cleaned)

       Name  Gender Profession      Hobby   Hometown
0   Praveen    Male     Doctor    Singing    Lucknow
1     Rahul    Male   Engineer    Cricket  Bangalore
2     Rohit    Male   Engineer    Singing     Mumbai
3     Virat    Male    Teacher    Dancing      Delhi
4   Shreyas    Male     Singer    Cooking  Bangalore
5    Ishaan    Male     Doctor    Dancing    Kolkata
6     Umesh    Male   Engineer    Singing    Chennai
7    Vineet    Male      Actor  Sketching    Gurgaon
8     Aarti  Female     Singer  Sketching    Lucknow
9    Babita  Female   Engineer    Cooking  Ahmedabad
10    Kusum  Female   Engineer  Sketching  Hyderabad
11    Kirti  Female    Teacher  Sketching   Guwahati
12     Puja  Female     Singer    Cooking    Kolkata
13  Sangita  Female   Engineer    Cricket    Kolkata
14    Priya  Female      Actor    Dancing       Pune
15    Angad    Male   Engineer    Singing      Delhi
16    Suman    Male      Actor   Exercise     Mumbai
17    Divya  Female     Doctor   Exercise     Jaipur

In [26]:
# fill na values instead of dropping
#df_filled = df.fillna(1)
# convert all 
df_filled = df.fillna(df['Matriculation Marks'].mean(), inplace=True)
print(df_filled)

None

In [ ]:
df['Matriculation Marks'].fillna(df['Matriculation Marks'].mean(), inplace=True)
print(df)